Revit 2026 API

# WaveDistributionType Enumeration

---

The enumerated type representing the permitted values for the asset property "WaveDistribution" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WaveDistributionType
```
```vb
Public Enumeration WaveDistributionType
```
```cpp
public enum class WaveDistributionType
```
```fsharp
type WaveDistributionType
```

| Member name | Value | Description |
| --- | --- | --- |
| ThreeD | 1 |  |
| TwoD | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace